{"posts":[{"title":"","text":"OECT安装过程总结包含了Ubuntu初次安装与优化的命令，一键换源等 1.刷入Armbian 参考视频: 【在arm上同时跑三个系统？RK3566刷入ARM PVE开启all in one模式，性能榨干，玩法翻倍！】 https://www.bilibili.com/video/BV1giH7zME5P/?share_source=copy_web&amp;vd_source=06989335e2b736b8a0a32f9a7933f941 工具下载: https://docs.qq.com/doc/DS25QZ3dGV3JGQ0lB 可直接从硬盘启动,告别8G存储~ 2.常用命令 一键换源: 1bash &lt;(curl -sSL https://linuxmirrors.cn/main.sh) Docker一键换源: 1bash &lt;(curl -sSL https://linuxmirrors.cn/docker.sh) 3.安装BT(领取1年SSL) 1if [ -f /usr/bin/curl ];then curl -sSO https://download.bt.cn/install/install_panel.sh;else wget -O install_panel.sh https://download.bt.cn/install/install_panel.sh;fi;bash install_panel.sh ssl251104 4.安装Casaos(可选): 1wget -qO- https://get.casaos.io | bash Casaos软件拓展: 1https://play.cuse.eu.org/Cp0204-AppStore-Play.zip","link":"2026/02/10/oect%E5%88%B7armbian%E5%92%8Ccasaos%E6%80%BB%E7%BB%93/"},{"title":"","text":"用Docker搭建纸飞机自助媒体下载机器人[Telegram media down bot] [Nas搭建教程]使用Linux环境下Docker搭建，本教程只做分享无任何不良引导，引发任何问题本站不负任何责任！ 基于Dineshkarthik的项目， 电报视频下载，电报资源下载，跨平台，支持web查看下载进度 ，支持bot下发指令下载，支持下载已经加入的私有群但是限制下载的资源。 本文设备使用：网新云Oect (Nas) 系统：Armbian（Ubuntu） 提示：此Bot需要科学上网环境，如果你没有或不知道如何给 Nas &amp; 服务器 挂载梯子，请先看这篇文章(点击跳转)","link":"2026/02/11/%E7%BA%B8%E9%A3%9E%E6%9C%BA%E8%87%AA%E5%8A%A9%E5%AA%92%E4%BD%93%E4%B8%8B%E8%BD%BD%E6%9C%BA%E5%99%A8%E4%BA%BA%5BTelegram%20media%20down%5D/"},{"title":"","text":"在 Nas/服务器 上搭建 梯子/科学上网环境[让Docker不再为无法连接仓库而发愁]使用Linux环境下Docker搭建，本教程只做技术分享无任何不良引导，引发任何问题本站不负任何责任！【此教程只分享如何搭建科学上网的环境！！！用于科研等技术性需求，不提供梯子,魔法,科学上网订阅】 前情提要：​ 魔法有风险，使用需谨慎，如果只是因为无法连接Docker仓库的话，那么我推荐以下一键换源脚本： ​ Linux系统换源： 1bash &lt;(curl -sSL https://linuxmirrors.cn/main.sh) ​ Docker换源： 1bash &lt;(curl -sSL https://linuxmirrors.cn/docker.sh) Ps：在本教程中，梯子/魔法/科学上网环境，统一称为链路 那么，就开始吧！ 前期准备一台 服务器/Nas(运行Linux类型系统，且已经基本调教完毕) 运行配置最好: H &gt;= 512MB ; C &gt;= 1 如果你手握一台崭新服务器，先调教一下，更新软件包,换源 一.开始本教程所用环境/工具来源： Linux 一键安装 Clash 在你的 服务器/Nas 中一次性使用以下指令： 123git clone --branch master --depth 1 https://gh-proxy.org/https://github.com/nelvko/clash-for-linux-install.git \\ &amp;&amp; cd clash-for-linux-install \\ &amp;&amp; bash install.sh 其中 1https://gh-proxy.org 为加速链接，若该加速域名挂了，你可以将其替换为其他加速域名 [ 网上自己去搜 ] 卸载：在安装目录下执行： 1bash uninstall.sh 二.安装成功！安装成功后，控制台会显示访问链路配置页面的链接 若服务器上已经安装 防火墙 注意放行端口9090(宝塔面板自带防火墙噢，注意放行) 与服务器处于局域网则直接访问内网链接： http://192.168.3.151:9090/ui 处于公网则访问： http://你的服务器IP:9090/ui 或者访问公共面板地址： http://board.zash.run.place 三.配置控制台命令 1234567891011121314151617Usage: clashctl COMMAND [OPTIONS]Commands: on 开启代理 off 关闭代理 status 内核状况 proxy 系统代理 ui Web 面板 secret Web 密钥 sub 订阅管理 upgrade 升级内核 tun Tun 模式 mixin Mixin 配置Global Options: -h, --help 显示帮助信息 Ps: clashon = clashctl on , 可用 Tab 补全 首次启动会让你添加一个订阅，输入链路地址即可 (有些链路使用特殊协议 此环境可能不适配而导致下载失败，请寻找其他教程) 若你要添加第二个订阅，则输入 1clashctl sub add 完全开启需要两个指令： 1.开启代理环境1clashon 2.开启代理（已经在面板选择好链路）1clashctl proxy on Ps: 若只开启了环境而没有开启代理，则链路无效 四.控制面板配置：放行端口后，打开对应的链接 会出现配置界面 其中主机一栏填写：你服务器的公网IP/局域网下你的Nas的内网IP 密码在每次安装时随机生成，在你安装完成时显示的“Web 控制台”下显示 12😼 当前密钥：******🎉 enjoy 🎉 将密钥填入密码一栏即可 进入面板后若要退出：点击左下角箭头，再点击弹出侧边栏的下方的加号，就可以回到配置界面 一般进入面板，代理界面就会自动显示你的 订阅/链路 ，选择好后再执行三.配置中的完全开启指令即可，建议用完后立即关闭。 好！大功告成！ Wait…. 还有必须的 常见问题解决环节 五.疑难杂症1.安装完后，控制台报错显示1'clashctl: command not found' 不必担心，这只是因为系统环境没有添加 链路环境 在你现在刚安装好程序的 终端/窗口（或者打开默认安装位置: ~/clash-for-linux-install) 执行 1bash -i 2.Docker内无法连接到链路，依旧使用普通网络打开登录Web面板 打开设置 下滑找到后端部分 打开允许局域网即可 Ps: 每次主机重启或环境重启都需要手动打开一下允许局域网选项 更多问题反馈与解决方法请到Github页面查看，此处只写日常遇到的问题 其他问题 跳转Wiki/FAQ 六.最后最后此行为有风险，操作请谨慎。再次申明 此教程只分享如何搭建科学上网的环境！！！用于科研等技术性需求，不提供梯子,魔法,科学上网订阅。若被不可抗力因素删除，本站没有义务解释和再次发布相关内容。","link":"2026/02/11/%E5%9C%A8%20Nas%E6%9C%8D%E5%8A%A1%E5%99%A8%20%E4%B8%8A%E6%90%AD%E5%BB%BA%20%E6%A2%AF%E5%AD%90%E7%A7%91%E5%AD%A6%E4%B8%8A%E7%BD%91%E7%8E%AF%E5%A2%83%5B%E8%AE%A9Docker%E4%B8%8D%E5%86%8D%E4%B8%BA%E6%97%A0%E6%B3%95%E8%BF%9E%E6%8E%A5%E4%BB%93%E5%BA%93%E8%80%8C%E5%8F%91%E6%84%81%5D/"}],"tags":[],"categories":[],"pages":[{"title":"ABOUT","text":"你好简单说，我的兴趣在于动手解决具体的技术问题。比起消费最新的科技产品，我更热衷于挖掘现有设备的潜力。一台运行缓慢的旧电脑，或是一部被淘汰的智能手机，在我眼中常常是绝佳的实验对象。周末花上几个小时，为它们尝试不同的操作系统或进行硬件调整，所带来的乐趣远大于纯粹的娱乐。 我的大部分知识来源于实践中的试错。因此，博客里记录的内容，很可能包含我成功实现某个想法的过程，也必然会有不少“翻车”的教训——比如某次鲁莽的刷机操作导致设备无法启动，或是自制的脚本产生了意料之外的后果。我认为这些解决问题的曲折路径，与最终的结果同样有价值。 我相信技术应当服务于人的具体需求。所以，我倾向于关注那些能提升效率、赋予设备更多自主权或解决实际麻烦的技巧与项目。从自动化一个繁琐的流程，到为老硬件寻找合适的软件方案，都是我觉得有意义的事情。 这个博客，算是我个人探索过程的一个记录。我会在这里整理我学到的东西，拆解某个项目的步骤，也分享遇到的坑。如果你也对类似的“折腾”感兴趣，或者正被某个具体的技术问题困扰，或许这里的内容能给你提供一点参考或思路。 感谢你的停留。如果有什么想法或问题，欢迎留言交流。 Hey, I Run This Place.Call me a tinkerer, a fixer, or someone who stares at terminals for fun. My hobby? Giving old tech a second life—or a gloriously weird third one. That sluggish laptop destined for e-waste? Challenge accepted. That phone older than some memes? Perfect candidate for a software transplant. My desk isn’t messy; it’s an “active archaeological dig site” for silicon. My learning curve is 90% glorious failures. This blog documents the journey: the wins, the facepalms, and the quiet chaos of commands that broke everything at 2 AM. I once tried to make a smart toaster. It just toasted the word “HELP” onto bread. We don’t talk about that. I believe tech should work for you, not the other way around. So, I’m all about practical mischief: automating boring tasks, squeezing performance from hardware that officially “retired,” and writing scripts that basically do my chores. Think of it as digital duct tape and hope. This blog is my lab notebook—a mix of semi-coherent tutorials, troubleshooting war stories, and thoughts that hit during my fourth cup of coffee. It’s for anyone who’s ever thought, “I could probably fix this,” right before making it significantly worse (and then actually fixing it). If you also speak in error logs, believe sudo is a magic word, and find the sound of a server booting up calming… you might be my kind of people. TL;DR: I poke machines until they do cool things. Sometimes they fight back. Let’s laugh about it. P.S. My spirit animal is a Rasberry Pi running a pointless but beautiful script. My greatest fear is a missing semicolon.","link":"about/index.html"}]}