{"posts":[{"title":"","text":"OECT安装过程总结包含了Ubuntu初次安装与优化的命令，一键换源等 1.刷入Armbian 参考视频: 【在arm上同时跑三个系统？RK3566刷入ARM PVE开启all in one模式，性能榨干，玩法翻倍！】 https://www.bilibili.com/video/BV1giH7zME5P/?share_source=copy_web&amp;vd_source=06989335e2b736b8a0a32f9a7933f941 工具下载: https://docs.qq.com/doc/DS25QZ3dGV3JGQ0lB 可直接从硬盘启动,告别8G存储~ 2.常用命令 一键换源: 1`bash &lt;(curl -sSL https://linuxmirrors.cn/main.sh)` Docker一键换源: 1`bash &lt;(curl -sSL https://linuxmirrors.cn/docker.sh)` 3.安装BT(领取1年SSL) 1`if [ -f /usr/bin/curl ];then curl -sSO https://download.bt.cn/install/install_panel.sh;else wget -O install_panel.sh https://download.bt.cn/install/install_panel.sh;fi;bash install_panel.sh ssl251104` 4.安装Casaos(可选): 1`wget -qO- https://get.casaos.io | bash` Casaos软件拓展: 1`https://play.cuse.eu.org/Cp0204-AppStore-Play.zip`","link":"2026/02/10/oect%E5%88%B7armbian%E5%92%8Ccasaos%E6%80%BB%E7%BB%93/"}],"tags":[],"categories":[],"pages":[{"title":"about","text":"你好简单说，我的兴趣在于动手解决具体的技术问题。比起消费最新的科技产品，我更热衷于挖掘现有设备的潜力。一台运行缓慢的旧电脑，或是一部被淘汰的智能手机，在我眼中常常是绝佳的实验对象。周末花上几个小时，为它们尝试不同的操作系统或进行硬件调整，所带来的乐趣远大于纯粹的娱乐。 我的大部分知识来源于实践中的试错。因此，博客里记录的内容，很可能包含我成功实现某个想法的过程，也必然会有不少“翻车”的教训——比如某次鲁莽的刷机操作导致设备无法启动，或是自制的脚本产生了意料之外的后果。我认为这些解决问题的曲折路径，与最终的结果同样有价值。 我相信技术应当服务于人的具体需求。所以，我倾向于关注那些能提升效率、赋予设备更多自主权或解决实际麻烦的技巧与项目。从自动化一个繁琐的流程，到为老硬件寻找合适的软件方案，都是我觉得有意义的事情。 这个博客，算是我个人探索过程的一个记录。我会在这里整理我学到的东西，拆解某个项目的步骤，也分享遇到的坑。如果你也对类似的“折腾”感兴趣，或者正被某个具体的技术问题困扰，或许这里的内容能给你提供一点参考或思路。 感谢你的停留。如果有什么想法或问题，欢迎留言交流。 Hey, I Run This Place.Call me a tinkerer, a fixer, or someone who stares at terminals for fun. My hobby? Giving old tech a second life—or a gloriously weird third one. That sluggish laptop destined for e-waste? Challenge accepted. That phone older than some memes? Perfect candidate for a software transplant. My desk isn’t messy; it’s an “active archaeological dig site” for silicon. My learning curve is 90% glorious failures. This blog documents the journey: the wins, the facepalms, and the quiet chaos of commands that broke everything at 2 AM. I once tried to make a smart toaster. It just toasted the word “HELP” onto bread. We don’t talk about that. I believe tech should work for you, not the other way around. So, I’m all about practical mischief: automating boring tasks, squeezing performance from hardware that officially “retired,” and writing scripts that basically do my chores. Think of it as digital duct tape and hope. This blog is my lab notebook—a mix of semi-coherent tutorials, troubleshooting war stories, and thoughts that hit during my fourth cup of coffee. It’s for anyone who’s ever thought, “I could probably fix this,” right before making it significantly worse (and then actually fixing it). If you also speak in error logs, believe sudo is a magic word, and find the sound of a server booting up calming… you might be my kind of people. TL;DR: I poke machines until they do cool things. Sometimes they fight back. Let’s laugh about it. P.S. My spirit animal is a Rasberry Pi running a pointless but beautiful script. My greatest fear is a missing semicolon.","link":"about/index.html"}]}